app/views/user/training_managements/index.html.erb

SELECT "training_managements".* FROM "training_managements" WHERE "training_managements"."user_id" = ?  [["user_id", 1]]
SELECT "training_records".* FROM "training_records" WHERE "training_records"."training_management_id" = ?  [["training_management_id", 1]]
---

	<% current_user.training_managements.each do |management| %>
	<% management.training_records.each do |record| %>