app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("genre_name", "class_status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["genre_name", "肩"], ["class_status", 0], ["created_at", "2020-03-12 06:49:00.029783"], ["updated_at", "2020-03-12 06:49:00.029783"]]
---
  def create
  	@genre = Genre.new(genre_params)
  	@genre.save