app/controllers/admin/trainings_controller.rb

INSERT INTO "trainings" ("genre_id", "training_name", "youtube_url", "description", "number_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@training = Training.new(training_params)
  	url = params[:training][:youtube_url]
  	url = url.last(11)
  	@training.youtube_url = url
  	@training.save

SELECT "genres".* FROM "genres" WHERE "genres"."class_status" = ?  [["class_status", "0"]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trainings".* FROM "trainings"
---
  def index
     @genres = Genre.where(class_status: '0')
    if params[:genre_id]
      @genre = Genre.find(params[:genre_id])
      @trainings = @genre.trainings.all