app/controllers/user/conduct_trainings_controller.rb

  def create
    @training = Training.find(params[:conduct_training][:training_id])

    @conduct_training = ConductTraining.new(user_id: current_user.id,training_id: params[:conduct_training][:training_id],set_count: params[:conduct_training][:set_count])
    @conduct_training.save
---
SELECT  "conduct_trainings".* FROM "conduct_trainings" WHERE "conduct_trainings"."training_id" = ? LIMIT ?  [["training_id", 1], ["LIMIT", 1]]
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "conduct_trainings" ("user_id", "training_id", "set_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["training_id", 1], ["set_count", 2], ["created_at", "2020-03-12 06:55:02.026338"], ["updated_at", "2020-03-12 06:55:02.026338"]]

  def update
    @conduct_training = ConductTraining.find(params[:id])
---
SELECT  "conduct_trainings".* FROM "conduct_trainings" WHERE "conduct_trainings"."training_id" = ? LIMIT ?  [["training_id", 1], ["LIMIT", 1]]
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
  	@conduct_training = ConductTraining.find(params[:id])
---
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "conduct_trainings".* FROM "conduct_trainings" WHERE "conduct_trainings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]