app/controllers/user/messages_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 2], ["room_id", 1]]
INSERT INTO "messages" ("content", "created_at", "updated_at", "room_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "こんにちは"], ["created_at", "2020-03-11 07:48:46.074385"], ["updated_at", "2020-03-11 07:48:46.074385"], ["room_id", 1], ["user_id", 2]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def create
		if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id]).present?
			@message = Message.create(message_params)
			@entry = Entry.where(room_id: @message.room_id).where.not(user_id: current_user.id)
			@entry.each do |entry|