app/controllers/user/posts_controller.rb

  def create
  	@post = Post.new(post_params)
  	@post.user_id = current_user.id
  	@post.save
---
INSERT INTO "posts" ("impression", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["impression", "ううううううううう。"], ["created_at", "2020-03-11 08:19:46.339117"], ["updated_at", "2020-03-11 08:19:46.339117"], ["user_id", 3]]

  def index
  	@user = current_user
  	@post = Post.new
    @posts = Post.all.paginate(page: params[:page],per_page: 5).order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"