app/controllers/user/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-03-11 07:01:34.863604"], ["updated_at", "2020-03-11 07:01:34.863604"]]
INSERT INTO "entries" ("created_at", "updated_at", "user_id", "room_id") VALUES (?, ?, ?, ?)  [["created_at", "2020-03-11 07:01:34.908812"], ["updated_at", "2020-03-11 07:01:34.908812"], ["user_id", 2], ["room_id", 1]]
INSERT INTO "entries" ("created_at", "updated_at", "user_id", "room_id") VALUES (?, ?, ?, ?)  [["created_at", "2020-03-11 07:01:34.936484"], ["updated_at", "2020-03-11 07:01:34.936484"], ["user_id", 1], ["room_id", 1]]
---
	def create
		@room = Room.create
		@entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
		@entry2 = Entry.create(params.require(:entry).permit(:user_id,:room_id).merge(:room_id => @room.id))

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 3]]
---
	def index
		@user = current_user
		@currentEntries = current_user.entries
		myRoomIds = []
		@currentEntries.each do |entry|

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 3], ["room_id", 18]]
---
	def show
		@room = Room.find(params[:id])
		if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?