app/controllers/user/trainings_controller.rb

  def index
    @genres = Genre.where(class_status: '0')
    if params[:genre_id]
      @genre = Genre.find(params[:genre_id])
      @trainings = @genre.trainings.all
---
SELECT "genres".* FROM "genres" WHERE "genres"."class_status" = ?  [["class_status", "0"]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "trainings".* FROM "trainings" WHERE "trainings"."genre_id" = ?  [["genre_id", 4]]

  def show
  	@training = Training.find(params[:id])
---
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]