app/controllers/user/training_managements_controller.rb

SELECT "training_managements".* FROM "training_managements" WHERE "training_managements"."user_id" = ?  [["user_id", 1]]
SELECT "training_records".* FROM "training_records" WHERE "training_records"."training_management_id" = ?  [["training_management_id", 1]]
---
  def index
    # @training_managementの中に時間、トレーニング名、回数、セット数を配列で入れる
  	@training_management = []
      current_user.training_managements.each do |management|
      management.training_records.each do |record|

INSERT INTO "training_managements" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2020-03-12 06:55:12.555619"], ["updated_at", "2020-03-12 06:55:12.555619"], ["user_id", 1]]
SELECT "conduct_trainings".* FROM "conduct_trainings" WHERE "conduct_trainings"."user_id" = ?  [["user_id", 1]]
INSERT INTO "training_records" ("training_management_id", "training_id", "set_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["training_management_id", 1], ["training_id", 1], ["set_count", 2], ["created_at", "2020-03-12 06:55:12.600172"], ["updated_at", "2020-03-12 06:55:12.600172"]]
DELETE FROM "conduct_trainings" WHERE "conduct_trainings"."id" = ?  [["id", 1]]
---
  def create
  	# 記録するボタンを押した時
  	@training_management = TrainingManagement.new
  	@training_management.user_id = current_user.id


  	if @training_management.save!

       # 実施トレーニング種目を１つ１つを空箱を作ってセーブする
  	   current_user.conduct_trainings.each do |conduct|

    	   @training_record = TrainingRecord.new
    	   @training_record.training_management_id = @training_management.id
    	   @training_record.training_id = conduct.training_id
    	   @training_record.set_count = conduct.set_count
    	   @training_record.save!
	     end

    	   current_user.conduct_trainings.destroy_all