app/controllers/user/weights_controller.rb

SELECT  "weights".* FROM "weights" ORDER BY "weights"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
  	@weights = Weight.all