app/views/users/show.html.erb

			<h3>最近の投稿</h3>
					<% current_user.posts.order(created_at: :desc).each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]