app/views/user/posts/show.html.erb

						<% end %>
						<%= @post.favorites.count %> 件のいいね<td>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 2]]

					    <% end %>
					    <%= @post.favorites.count %> 件のいいね</td>
					<% end %>
					<% @post.favorites.each do |favorite| %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]

			<h3>コメント</h3>
			<% @post.post_comments.each do |comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]