app/views/admin/trainings/new.html.erb

      <th>ジャンル</th>
      <td><%= f.collection_select(:genre_id, Genre.where(class_status: '0'), :id, :genre_name) %></td>
---
SELECT "genres".* FROM "genres" WHERE "genres"."class_status" = ?  [["class_status", "0"]]