app/controllers/users_controller.rb

  def update
  	user = User.find(params[:id])
  	user.update(user_params)
---
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "c22ec3f87aa05610ce1f3a7fa04ce35d64c37fc300116e168ae6ee519e15"], ["introduction", "よろしく。よろしく。よろしく。よろしく。"], ["updated_at", "2020-03-11 03:05:11.878856"], ["id", 1]]