app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @weight = Weight.last
    @post = current_user.posts.paginate(page: params[:page],per_page: 5).order(created_at: :desc)
    # DM機能
    @currentEntry = Entry.where(user_id: current_user.id)
    @userEntry = Entry.where(user: @user.id)
    if @user.id == current_user.id

    else
      @currentEntry.each do |cu|
        @userEntry.each do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "weights".* FROM "weights" ORDER BY "weights"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 11]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]

  def update
  	user = User.find(params[:id])
  	user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "491b7ac0b2c8959d8f3e29f24bbca0fadd6e0232126b50dec2bf4d6d4dba"], ["introduction", ""], ["updated_at", "2020-03-11 08:19:30.891780"], ["id", 3]]