app/models/post.rb

SELECT  1 AS one FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
    def create_notification_favorite!(current_user)
    	#いいねされているか検索
    	temp = Notification.where(["visetor_id = ? and visited_id = ? and action = ?",current_user.id, user_id, 'favorite'])
    	#いいねされていない場合、レコードを作成する条件分岐(tempの中が空の場合true)
    	if temp.blank?