app/views/user/weights/index.html.erb

SELECT "weights"."created_at", "weights"."weight" FROM "weights"
---
			<h2>体重</h2>
			<%= column_chart Weight.pluck(:created_at, :weight),
			    id:'weight-chart',
				width:'600px',
				height:'600px' %>

SELECT "weights"."created_at", "weights"."bmi" FROM "weights"
---
			<h2>BMI</h2>
			<%= column_chart Weight.pluck(:created_at, :bmi),
			    id:'bmi-chart',
				width:'600px',
				height:'600px' %>

SELECT "weights".* FROM "weights" WHERE "weights"."user_id" = ?  [["user_id", 1]]
---

<% current_user.weights.each do |weight| %>